## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_dns_zone.tftest2-mjw will be created
  + resource "azurerm_dns_zone" "tftest2-mjw" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "tfttest2.matthewjwhite.co.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "rg-whitefam-dnszones"
      + tags                      = {
          + "managed" = "as-code"
          + "source"  = "terraform"
        }

      + soa_record (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>